In [1]:
import pandas as pd

In [3]:
# Load Data
df = pd.read_csv("C:\data\single_customer_view.csv")

In [4]:
df.head()

,Customer_name,TotalOrders,TotalQuantity,TotalSales,FirstPurchaseDate,LastPurchaseDate
0,Amit,29,57,735900,2024-01-07,2024-04-25
1,Anjali,18,35,380800,2024-01-12,2024-04-30
2,Kunal,25,55,670900,2024-01-02,2024-04-29
3,Neha,29,56,285200,2024-01-16,2024-04-30
4,Priya,26,46,487300,2024-01-11,2024-04-27

In [5]:
# Date Conversion
df['LastPurchaseDate'] = pd.to_datetime(df['LastPurchaseDate'])

In [6]:
df.head()

,Customer_name,TotalOrders,TotalQuantity,TotalSales,FirstPurchaseDate,LastPurchaseDate
0,Amit,29,57,735900,2024-01-07,2024-04-25
1,Anjali,18,35,380800,2024-01-12,2024-04-30
2,Kunal,25,55,670900,2024-01-02,2024-04-29
3,Neha,29,56,285200,2024-01-16,2024-04-30
4,Priya,26,46,487300,2024-01-11,2024-04-27

In [7]:
df.tail()

,Customer_name,TotalOrders,TotalQuantity,TotalSales,FirstPurchaseDate,LastPurchaseDate
3,Neha,29,56,285200,2024-01-16,2024-04-30
4,Priya,26,46,487300,2024-01-11,2024-04-27
5,Rahul,22,50,395300,2024-01-05,2024-04-24
6,Rohit,21,42,413800,2024-01-04,2024-04-19
7,Suman,30,51,674300,2024-01-02,2024-04-30

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Customer_name      8 non-null      object
 1   TotalOrders        8 non-null      int64
 2   TotalQuantity      8 non-null      int64
 3   TotalSales         8 non-null      int64
 4   FirstPurchaseDate  8 non-null      object
 5   LastPurchaseDate   8 non-null      datetime64[ns]
dtypes: datetime64[ns](1), int64(3), object(2)
memory usage: 512.0+ bytes

In [13]:
# Recency Calculation
today = df['LastPurchaseDate'].max() + pd.Timedelta(days=1)

df['Recency'] = (today - df['LastPurchaseDate']).dt.days

In [16]:
df[['Customer_name','Recency']].head()

  Customer_name  Recency
0          Amit        6
1        Anjali        1
2         Kunal        2
3          Neha        1
4         Priya        4

In [17]:
# Frequency and Monetary Calculation
df['Frequency'] = df['TotalOrders']
df['Monetary'] = df['TotalSales']

In [18]:
df[['Customer_name','Frequency','Monetary']].head()

  Customer_name  Frequency  Monetary
0          Amit         29    735900
1        Anjali         18    380800
2         Kunal         25    670900
3          Neha         29    285200
4         Priya         26    487300

In [19]:
df[['Customer_name','Recency','Frequency','Monetary']].head()

  Customer_name  Recency  Frequency  Monetary
0          Amit        6         29    735900
1        Anjali        1         18    380800
2         Kunal        2         25    670900
3          Neha        1         29    285200
4         Priya        4         26    487300

In [28]:
def segment_customer(row):
    if row['Recency'] <=2 and row['Frequency'] >=25 and row['Monetary'] >=600000:
        return 'Champion'
    elif row['Frequency'] >=20 and row['Monetary'] >=300000:
        return 'Loyal'
    else:
        return 'Hibernating'

df['Segment'] = df.apply(segment_customer, axis=1)

In [29]:
df[['Customer_name','Segment']].head()

  Customer_name      Segment
0          Amit        Loyal
1        Anjali  Hibernating
2         Kunal     Champion
3          Neha  Hibernating
4         Priya        Loyal

In [30]:
df['Segment'].value_counts()

Loyal          4
Hibernating    2
Champion       2
Name: Segment, dtype: int64

In [34]:
df.to_csv("rfm_output_consumer360.csv", index=False)

In [32]:
df[['Customer_name','LastPurchaseDate','Recency','Frequency','Monetary','Segment']].head()

  Customer_name LastPurchaseDate  Recency  Frequency  Monetary      Segment
0          Amit       2024-04-25        6         29    735900        Loyal
1        Anjali       2024-04-30        1         18    380800  Hibernating
2         Kunal       2024-04-29        2         25    670900     Champion
3          Neha       2024-04-30        1         29    285200  Hibernating
4         Priya       2024-04-27        4         26    487300        Loyal